// class EventRecord {
//     constructor(pic, desc) {
//         this.pic = pic;
//         this.desc = desc;
//     }
// }
// class PicDesc {
//     constructor(pic, desc) {
//         this.pic = pic;
//         this.desc = desc;
//     }
// }
// class DateRecord {
//     constructor(date,title,picDescs,desc,eventRecords,eventPics) {
//         this.date = date;
//         this.title = title;
//         this.picDescs = picDescs;
//         this.desc = desc;
//         this.eventRecords = eventRecords;
//         this.eventPics = eventPics;
//     }
// }

let loveRecords = [
    {
        date: '2019-05-23',
        title: '心声缘起时',
        desc: '心声上加了位小姐姐，下班后一般寒暄，倒是没有太尬。倒是她冒出来一句“小哥哥，您要接续接触吗”，下了我一跳。这小姐姐很直呀！难道以前和女孩子聊天总冷场就是因为对方冷漠而已？',
        pics: [
            {
                url: '2019-05-23-初次寒暄.jpg',
                desc: '初次寒暄'
            }
        ],
    },
    {
        date: '2019-05-26',
        title: '约饭初相见',
        desc: `和心声小姐姐聊得蛮投机的，对方很主动，“推动”着我约了个饭……
        今晚和心声小姐姐吃了个饭，唱了个歌。交流中规中矩，但没出啥问题，总算又有了饭友。（ps.第一次通过“相亲”渠道直接进入约会流程……）`,
        pics: [
            {
                url: '2019-05-23-初次约会之地.jpg',
                desc: '初次约会之地'
            }
        ],
    },
    {
        date: '2019-06-01',
        title: '儿童节快乐！',
        desc: `
        6.1“儿童节”？去蛋糕DIY店做手工感受下童年的气息，去莲花山看了看灯光秀，看到小孩子在玩跳房子，回五和喝了点小酒。混混沌沌的一天就这么度过。
        （ps.今天和心声小姐姐的约会氛围在慢热中升温，手工DIY比想象中的无趣，商场溜达毫无亮点。等到晚上来到书城和莲花山，四下转悠也总觉得氛围没有踩到点上。感觉今天就要这么凉了。然而待一场灯光秀后，一起找了个座椅休息，开始互诉心声，两个人反正自在了很多。其倒是阐明了进一步发展的想法，以及对浪漫爱情的憧憬。她对我蛮有好感的，她在我眼里也是一个不错有趣的女孩。不过我却是从没和这种女孩深入接触过，心中还是有一些忐忑。更多的，却也还是憧憬和期盼。
        莲花山上待足了两场灯光秀，才返程。趁着时下的氛围不错，提议在回家前到“匆匆那年”清吧小坐一会，其也是“矫情”的答应了。清吧里灯光幽暗，气氛迷离，酒水作伴。只是简单聊聊天，情绪却也是直线升温。晚上送她回去时，便已是十指相扣。进度，比我想象中快。
        ）
        `,
        pics: [
            "2019-06-01-六一儿童节制作蛋糕.jpg",
            "2019-06-01-六一儿童节莲花山跳房子.jpg"
        ],
    },
    {
        date: '2019-06-02',
        title: '约会标准流程',
        desc: `
        和阿莲约了个电影&点都德。觉得自己有些无趣。也可能是《哥斯拉》太无聊了吧。
        （ps.发现自己真正是个无趣的人。更准确的说，是个嫌麻烦的人。本来以为今天可以好好休息一下的，然而昨晚阿莲说今天有汉子准备约她看电影，疯狂激我行动。于是我便约了她看电影。以为看脸电影就可以送她回家了，又说想玩。完全没安排呀。只得继续找吃的。折腾去找“点都德”、“重庆火锅”。阿莲倒是没嫌弃什么，自己却是压力山大。后面饭也吃完了，时候还早，接着手机马上没电的由头，才把阿莲送了回去。然而，今天明显有些扫兴……
        ）`,
    },
    {
        date: '2019-06-03',
        title: '撒娇女人最好命',
        desc: `
        和阿莲聊了聊情侣准则，被提（cuo)了不少好男友准则……
        女生很注重细节的，要每天晚上聊天，要每天说早晚安，要学会安排怎么出去玩，要每天浇水……
        女生矫情起来真可怕。`,
    },
    {
        date: '2019-06-05',
        title: '挑剔女友教做人（男票）',
        desc: `
        今晚被提意见了，教做人（男票）。
        （ps.没有做好阿莲要求的这些细节，又有些言行不检点，于是今天被音频批了一顿。原来真正的一般的女孩子真的是这样哒。然后又画风一转，“我身边的朋友都说你这样子根本就不在于我，不过我还是对你很抱有期望的”。然后自己也便见势献殷勤，也忘了自己说了些什么，反正最后她也便乐呵开心了起来，聊过来两三个小时……危机解除。
        哎，战战兢兢，如履薄冰。哄女孩子真的是一门艺术。自己从小太大就太高傲了，试试不一样的相处方式吧。）`,
    },
    {
        date: '2019-06-08',
        title: '瓜熟蒂落收获时',
        desc: `
        浪到疲惫的一天~
        上午去壹方城预约“外婆家”吃杭帮菜，久违的回忆的味道。大学时候部门聚餐最爱的地方。
        然后逛着逛着配了一身嘻哈风格的穿搭，感觉还不赖，新尝试，新改变。
        然后沿路去了南山博物馆，在“大象中原———河南古代文明之光”专题展厅里逛悠逛悠了一个多小时。
        等到气温逐渐凉下来，再去不远的“荷兰花卉小镇”拍照游玩。今天的深圳蓝是真的惊艳！每一张照片都是那么让人舒适惬意。
        到了饭点，又回到壹方城觅食，排了胡桃里，竟然要等27桌。便临时去另一家精酿啤酒店里点了吃喝。吃到尾声，胡桃里的排号也到了，索性又去胡桃里网红餐吧二次消费。不得不说，胡桃里的灯光和音乐，真的很舒服。

        （ps.感觉阿莲（女孩子）在感情中真的很有套路诶。各种为我创造机会。虽然她总说我有趣，但其实在大的方针动作上，都是她创造的机会，才有我发挥的空间~

        又是标志性的一天。阿莲喜欢灯光暗一点，氛围好一点的饭店。恋爱中的小情调还是需要滴。于是乎，又选了小酒馆一起小酌调情。胡桃里的氛围真的很棒，要不是地铁11点截止，怕是会在这里沉醉到深夜。然而在这个荷尔蒙飙升的夜里，我带她回了狼窝，美名其曰家里有花瓶正好可以送她装花。
        可真正领回家了，反而是不知所措。她倒是像回到自己家，吃吃水果，躺着看看视频。我赶紧收拾一下这邋遢的房间……然而啥事不做总觉得氛围不对，想要亲热，却又欲情故纵，疯狂暗示表白。好吧，确实缺少一次仪式性的正式表白。临时在网上订了一捧玫瑰，仓促间拼凑出言语来个表白。于是，她来了一句，那我陪你到3点吧……妈耶，我困得要死啦，还有一两个小时呢，强撑着一起找电影看吧。熬到了3点，竟然又不回去了。好吧，都这么明显了，就在我这里睡吧……两个迷迷糊糊的人抱着一起互诉寂寞，一番亲热。反正我是没过多久就耐不住睡死了，等我7点中途醒来，阿莲却是不见了。

        耍朋友是真真烧钱呀！一路打车奶茶几十上百，“被买”一套衣服几百，晚上两个小酒馆做做，又是三四百，送个花，又是两百。肉疼。
        不过这样的感觉才是我设想中的恋爱，阿莲是我的药引。
        ）`,
        pics: [
            "2019-06-08-外婆家约饭.jpg",
            "2019-06-08-花卉小镇小憩.jpg",
            "2019-06-08-胡桃里音乐餐吧.jpg",
            "2019-06-08-嘻哈风新皮肤.jpg"
        ]
    },
    {
        date: '2019-06-09',
        title: '爱情纪念日',
        desc: `
        收到《三体艺术插画集》，如获珍宝！第一次收到这么对胃口的礼物！
        （今晚去见阿莲，本以为把她昨晚落在我家的东西送回去就可以回来补觉了，然而没那么容易……一个吃个饭，一起逛悠，然后一个劲像我要礼物。我猛地以为自己上套了。她希望这一天能够特殊，能够定期有个小惊喜以温存。顿时有些哑口。总之后面的时间都被她搞得有点沉闷，自己也不知道说啥。于是，手机又要没电了，又以这个借口先行送她回去。【手机总在关键时刻缺点助我一臂之力~】
        带她回到家却说有东西要送个我，就是这个插画集。相当贵重了，顿时感动得热泪盈眶，兴奋得手舞足蹈，竟然能送给我这么对胃口的礼物，如获珍宝！对她的好感度，顿时砰砰砰砰地网上蹿，也消除了一些我对她不好的顾虑。然而，接下来，我也要准备给她的礼物了。
        ）`,
        pics: [
            "2019-06-09-牵手成功心花怒放.jpg",
            "2019-06-09-三体艺术插画集1.jpg",
            "2019-06-09-三体艺术插画集2.jpg",
        ],
    },
    {
        date: '2019-06-11',
        title: '爱情纪念册',
        desc: `
        花了两天，准备了一个绚丽动感的网页——“爱情纪念册”，并带上了一首打油诗，总结了认识的过程。
        >日料馆里初相识,
        K T V内共知悉。
        莲花山上心交错,
        匆匆那年意朦胧。
        也曾不懂女人心，
        迷途知返促膝谈。
        情深意切共端阳，
        夫妻双双把家还。
        `,
    },
    {
        date: '2019-07-12',
        title: '喜结莲李戒指到',
        desc: `
        “喜结莲李”~戒指收到。然而戴着实在不习惯~
        阿莲在我们这段感情中比我更多一份勇敢
        `,
        pics: [
            "2019-07-12-喜结莲李戒指_男.jpg",
            "2019-07-12-喜结莲李戒指_女.jpg",
        ],
    },
    {
        date: '2019-07-28',
        title: '拉黑/开车——恩威并施',
        desc: `
        一大早起来，发现被阿莲拉黑了。早安、视频发不出，电话几通都挂机。赶紧发个短信补救一下。

        在去漂流的车上，阿莲总算回消息了。一番劝慰，又可以正常的“开车了”。

        今晚又是和阿莲开车的一天，尺度略大，略去n万字。
        `,
    },
    {
        date: '2019-08-03',
        title: '暴躁女友初显形',
        desc: `
        今晚和阿莲的约饭，一波三折，竟然搞得我动了火，她生了气。罪过罪过。还是不能和女孩子讲道理的。哄就完事了。    不要总是抱着提供方案的思路去解决问题，可以试着从人的角度去解决问题。
        `,
    },
    {
        date: '2019-08-04',
        title: '海底捞的异地约饭',
        desc: `
        晚上独自一人去海底捞吃火锅。这是我第二次一个人吃火锅。不过这次却没那么落寞。海底捞的服务很到位，关键是有一位可爱的人儿也在陪我远程吃着火锅聊着天。Nice。
        `,
        pics: [
            "2019-08-04-海底捞的异地约饭.jpg",
        ],
    },


    {
        date: '2019-08-11',
        title: '异地观影——烈火英雄',
        desc: `

        `,
        pics: [
            "2019-08-11-烈火英雄观影.jpg",
        ],
    },

    {
        date: '2019-08-17',
        title: '相聚深圳，为爱鼓掌',
        desc: `
        射箭
        火锅
        UK
        胡桃里
        `,
        pics: [
            "2019-08-17-弓客联盟神箭手.jpg",
            "2019-08-17-谭鸭血老火锅.jpg",
            "2019-08-17-UK网红KTV打卡.jpg",
            "2019-08-17-胡桃里音乐餐吧.jpg",
        ],
    },

    {
        date: '2019-08-22',
        title: '深圳出差试探',
        desc: `

        `,
        pics: [
            "2019-08-22-出差意愿试探.jpg", 
        ],
    },

    {
        date: '2019-09-08',
        title: '我俩的故事',
        desc: `
        书
        `,
        pics: [
            "2019-09-08-我俩的故事.jpg", 
        ],
    },

    {
        date: '2019-09-11',
        title: '明月当空，美人如虹',
        desc: `
        礼物
        `,
        pics: [
            "2019-09-11-中秋节礼物.jpg", 
        ],
    },

    {
        date: '2019-09-15',
        title: '中秋相聚日',
        desc: `
        9/13/14/15
        `,
        pics: [
            "2019-09-13-甜美和服莲.jpg",
            "2019-09-14-活力拍档.jpg",
            "2019-09-14-外婆家の一餐.jpg",
            "2019-09-14-重返紫金港情人坡.jpg",
            "2019-09-15-潮男喜.jpg",
            "2019-09-15-中秋相聚恩爱时.jpg", 
        ],
    },

    {
        date: '2019-10-10',
        title: '纪念日礼物——挎包、华为手表',
        desc: `

        `,
        pics: [
            "2019-10-10-阿莲送的潮男挎包.jpg", 
        ],
    },

    {
        date: '2019-10-27',
        title: '重归深圳——Shopping',
        desc: `

        `,
        pics: [
            "2019-10-27-和美美的阿莲逛吃八号仓.jpg",
            "2019-10-27-阿莲为我挑的全套装扮.jpg",
        ],
    },
    {
        date: '2019-11-09',
        title: '纪念日活动——石居日料',
        desc: `

        `,
        pics: [
            "2019-11-09-美美的阿莲.jpg", 
            "2019-11-09-萌萌的七喜.jpg", 
        ],
    },
    {
        date: '2019-11-10',
        title: '同居第一天：抄手教学',
        desc: `

        `,
        pics: [
            "2019-11-10-抄手成果图.jpg", 
        ],
    },
    
    {
        date: '2019-11-17',
        title: '海底捞庆生——for阿莲',
        desc: `

        `,
        pics: [
            "2019-11-17-海底捞庆生.jpg", 
        ],
    },
        
    {
        date: '2019-11-24',
        title: '深圳湾人才公园夜游',
        desc: `

        `,
        pics: [
            "2019-11-24-死亡打光.jpg",
            "2019-11-24-游归coco至.jpg",  
        ],
    },

    {
        date: '2019-12-07',
        title: '半周年纪念日——惠州海滨温泉旅',
        desc: `

        `,
        pics: [
            "2019-12-07-渔船出海.jpg",
            "2019-12-07-抱在一起都是比心的形状.jpg",
            "2019-12-07-泡温泉.jpg",
        ],
    },

    {
        date: '2019-12-25',
        title: '猫咖馆游玩',
        desc: `

        `,
        pics: [
            "2019-12-25-猫咖钓猫.jpg",
            "2019-12-25-猫咖撸猫.jpg",
        ],
    },

    {
        date: '2019-12-29',
        title: '欧洲小镇一日游',
        desc: `

        `,
        pics: [
            "2019-12-29-欧洲小镇一日游1.jpg",
            "2019-12-29-欧洲小镇一日游2.jpg",
            "2019-12-29-欧洲小镇一日游3.jpg",
        ],
    },

    {
        date: '2019-12-31',
        title: '19——20跨年夜',
        desc: `

        `,
        pics: [
            "2019-12-31-开心麻花共跨年.jpg"
        ],
    },



    {
        date: '2020-01-18',
        title: '盛大惊喜——我的生日',
        desc: `

        `,
        pics: [
            "2020-01-18-满屋子的生日惊喜.jpg",
            "2020-01-18-我的生日蛋糕.jpg",
            "2020-01-18-海底捞做寿星.jpg",
        ],
    },

    {
        date: '2020-01-22',
        title: '春节前一聚',
        desc: `

        `,
        pics: [
            "2020-01-22-节前腐败.jpg",
        ],
    },

    {
        date: '2020-02-09',
        title: '疫情居家厨艺赞',
        desc: `

        `,
        pics: [
            "2020-02-23-自制水果酸奶.jpg",
            "2020-02-09-超大份麻辣香锅.jpg",
            "2020-02-21-简易便当.jpg",
        ],
    },

    {
        date: '2020-02-14',
        title: '情人节情侣表',
        desc: `

        `,
        pics: [
            "2020-02-14-情人节情侣表.jpg",
        ],
    },

    {
        date: '2020-02-18',
        title: '高中日记现世，情感风雨飘摇',
        desc: `

        `,
        pics: [
            "2020-02-18-高中绝密档案.jpg"
        ],
    },

    {
        date: '2020-02-23',
        title: 'Rick And Morty超赞礼物',
        desc: `

        `,
        pics: [
            "2020-02-23-Rick and Morty插画集.jpg",
            "2020-02-24-Rick.jpg",
            "2020-02-24-Morty.jpg",
        ],
    },


    {
        date: '2020-03-15',
        title: '疫情后首浪——聚餐理发',
        desc: `

        `,
        pics: [
            "2020-03-15-饭前臭美.jpg",
            "2020-03-15-渣女带波浪.jpg",
        ],
    },


    {
        date: '2020-03-22',
        title: '拍照的乐趣',
        desc: `
        拍照
        `,
        pics: [
            "2020-03-21-恩爱的喜结莲李.jpg",
            "2020-03-21-傲娇莲.jpg",
            "2020-03-22-和服知性莲.jpg",
            "2020-03-22-娇羞惹人怜.jpg",
            "2020-03-16-双马尾的小奶妞.jpg",
        ],
    },

    {
        date: '2020-03-29',
        title: '草长莺飞——福田踏青',
        desc: `
        莲花山一游
        `,
        pics: [
            "2020-03-29-莲花山一游.jpg",
        ],
    },

    {
        date: '2020-05-01',
        title: '为了幸福——向岳父岳母家启程',
        desc: `
        
        `,
        pics: [
            "2020-05-01-向云南进发.jpg",
            "2020-05-01-云南的天.jpg",
        ],
    },


    {
        date: '2020-05-03',
        title: '原始森林公园一游',
        desc: `
        
        `,
        pics: [
            "2020-05-02-丈母娘家的饭菜口味很和我胃口.jpg",
            "2020-05-02-乡村风景照.jpg",
            "2020-05-03-国家森林公园一游.jpg",
        ],
    },

    {
        date: '2020-05-20',
        title: '520例行任务',
        desc: `
        
        `,
        pics: [
            "2020-05-20-520的爱情任务.jpg"
        ],
    },

    {
        date: '2020-06-07',
        title: '古装摄影新尝试',
        desc: `
        
        `,
        pics: [
            "2020-06-07-古装摄影1.jpg",
            "2020-06-07-古装摄影2.jpg",
            "2020-06-07-古装摄影3.jpg",
            "2020-06-07-古装摄影4.jpg",
            "2020-06-07-古装摄影5.jpg",
            "2020-06-07-古装摄影6.jpg",
            "2020-06-07-古装摄影7.jpg",
            "2020-06-07-古装摄影8.jpg",
            "2020-06-07-古装摄影9.jpg",
        ],
    },

    {
        date: '2020-06-09',
        title: '周年纪念日重回初见地',
        desc: `
        
        `,
        pics: [
            "2020-06-09-石居再聚.jpg"
        ],
    },
    
    {
        date: '2020-06-14',
        title: '新发型新装扮新气象',
        desc: `
        
        `,
        pics: [
            "2020-06-14-新发型.jpg",
            "2020-06-14-新衣服.jpg",
        ],
    },

    {
        date: '2020-06-26',
        title: '端午节华侨城双日游',
        desc: `
        
        `,
        pics: [
            "2020-06-25-七喜独照.jpg",
            "2020-06-25-阿莲独照.jpg",
            "2020-06-25-秘术_色诱之术.jpg",
            "2020-06-25-泡温泉.jpg",
            "2020-06-26-缆车上山.jpg",
            "2020-06-26-山顶观海.jpg",
            "2020-06-26-旋转木马1.jpg",
            "2020-06-26-旋转木马2.jpg",
        ],
    },

    {
        date: '2020-06-29',
        title: '医院急诊陪伴照顾',
        desc: `
        
        `,
        pics: [
            "2020-06-29-急性肠胃炎急诊.jpg"
        ],
    },

    {
        date: '2020-07-05',
        title: '虽迟但到，女票的手工纪念册',
        desc: "虽迟但到，女票的馈赠，很有意义，是我们爱情的记录<－biubiu－⊂(`ω´∩)",
        pics: [
            "2020-07-05-爱情纪念册封面.jpg",
            "2020-07-05-爱情纪念册序言.jpg",
            "2020-07-05-爱情纪念册内容1.jpg",
            "2020-07-05-爱情纪念册内容2.jpg",
        ],
    },

    
    {
        date: '2020-07-26',
        title: '聚餐唱歌的一天',
        desc: `
        
        `,
        pics: [
            "2020-07-26-KTV内的阿莲.jpg",
            "2020-07-26-KTV内的合照.jpg",
            "2020-07-26-聚餐美食.jpg"
        ],
    },

    {
        date: '2020-08-15',
        title: '自家做东的一顿饭',
        desc: `
        
        `,
        pics: [
            "2020-08-15-自家做东的 一顿饭.jpg",
        ],
    },

    
    {
        date: '2020-08-20',
        title: '合种的第一颗胡杨',
        desc: `
        
        `,
        pics: [
            "2020-08-20-合种的第一颗胡杨.jpg",
            "2020-08-20-美美的阿莲.jpg"
        ],
    },

    {
        date: '2020-08-22',
        title: '一如既往悠闲的周末生活',
        desc: `
        
        `,
        pics: [
            "2020-08-22-地铁里的一只小王八.jpg",
            "2020-08-22-爱上川北凉粉.jpg",
            "2020-08-23-第一套情侣服get.jpg"
        ],
    },

    {
        date: '2020-08-30',
        title: '配阿莲去查过敏原',
        desc: `
            查了过敏原，牛肉和鸡蛋竟然不能吃！对于阿莲这个健身爱好者来说，真是个噩耗
        `,
        pics: [
            "2020-08-30-偷吃的小机灵鬼.jpg"
        ],
    },

    {
        date: '2020-09-05',
        title: '你若安好，那还得了',
        desc: `
        
        `,
        pics: [
            "2020-09-05-话剧亮场.jpg",
        ],
    },

    {
        date: '2020-10-01',
        title: '国庆返乡共婵娟',
        desc: `

        `,
        pics: [
            "2020-09-30-启程机场.jpg",
            "2020-09-30-校园重游.jpg",
            "2020-10-01-清晨的豆花饭.jpg",
            "2020-10-01-他人婚宴.jpg",
            "2020-10-01-情侣合影.jpg",
            "2020-10-01-家庭合照.jpg",
            "2020-10-02-超带感的双椒长江鱼.jpg",
            "2020-10-02-逛街随手拍.jpg",
            "2020-10-02-老味道手工肥肠粉.jpg",
            "2020-10-02-全家上牌桌.jpg",
            "2020-10-03-串串火锅.jpg",
            "2020-10-04-KTV里自在唱.jpg"
        ],        
    },

    {
        date: '2020-10-06',
        title: '重庆夜游休闲逛',
        desc: `

        `,
        pics: [
            "2020-10-06-洪崖洞合影.jpg",
            "2020-10-07-磁器口扎彩辫.jpg",
            "2020-10-07-磁器口随手拍.jpg",
            "2020-10-07-朝天门随手拍.jpg",
            "2020-10-07-比翼天使.jpg"
        ],        
    },

    {
        date: '2020-10-11',
        title: '婚约初定',
        desc: `
        今天阿莲和她家人聊了订婚、领证、婚宴的安排。感觉一切都在路上了。人生的紧迫感。明年69日，领证办卡时
        `,
        pics: [
        ],        
    },

    {
        date: '2020-10-18',
        title: '制作家乡特此——炸酥肉',
        desc: `
        
        `,
        pics: [
            "2020-10-18-炸酥肉.jpg",
            "2020-10-18-酥肉成果图.jpg",
        ],        
    },
    
    {
        date: '2020-10-24',
        title: '阿莲带我进健身房',
        desc: `
        念叨几天的陪阿莲去健身房，拖到今天总算达成了。在健身房里阿莲陪我练了各种器械，作为我的专属私教为我讲解各个部位肌肉的锻炼。在各个肌肉力量的练习中，不得不忏愧自己比阿莲都弱了不止一点半点，尤其是核心及腹部力量。这就是坚持的力量呀！
        先以阿莲为目标，多多练习健身吧
        `,
        pics: [
            "2020-10-24-阿莲的健身照1.jpg",
            "2020-10-24-阿莲的健身照2.jpg",
        ],        
    },

]

export default loveRecords
